import {Component, OnInit} from '@angular/core';
import {MarkUpDataInterface} from '../../shared/interfaces/mark-up-data.interface';

@Component({
  selector: 'app-exchange-review',
  templateUrl: './exchange-review.component.html',
  styleUrls: ['./exchange-review.component.scss']
})
export class ExchangeReviewComponent implements OnInit {

  ratingStars!: number;

  exchangeData = {
    reviewHead: 'Kraken - одна из старейших и крупнейших криптовалютных площадок',
    numOfStars: 4,
    rating: '3.75',
    headInfoImg: 'https://content-cdn.meta.ua/brand-rating/brand/a3a809308138a92048a9f4ab57cc880d61570b80ddfb01a5011a17b0bdb85ac3.jpg',
    registrationLink: '123',
    topDescription: '    Kraken — одна из старейших и крупнейших криптовалютных площадок, которая появилась спустя два года после анонса\n' +
      '    биткоина как платежного средства. В 2019-м на платформу пришлось 13% от суммарного мирового оборота токенов.\n' +
      '    Проблем с тем,как торговать на бирже Kraken, у большинства пользователей не будет. Несмотря на возраст, сайт имеет\n' +
      '    простой, понятный, а главное, удобный интерфейс, в котором без труда разберется каждый.Регистрация на бирже Kraken\n' +
      '    тоже несложная. Для создания аккаунта достаточно указать адрес e-mail, придумать никнейм и пароль. Также\n' +
      '    понадобится пройти верификацию. Далее —обзор биржи Kraken, раскрывающий ее основные возможности и важные моменты\n' +
      '    работы с ней.'
  }

  simpleBoxMarkupData: MarkUpDataInterface[] = [
    {
      header: 'Биржа Kraken: возможности и торговля',
      body: '<p>Биржа Kraken появилась в 2011-м, сразу после мирового анонса криптовалюты Bitcoin. Полноценную работу торговая площадка начала лишь в 2013-м, после 2 лет разработки тестирования. У истоков сервиса стоит калифорниец Джесси Пауэлл. Он является учредителем и главным инвестором, а ранее также занимал руководящие посты в компании. На самом деле о Пауэлле мало что известно. Единственная достоверная информация, что он живет в Сан-Франциско и учредил еще одну фирму, Ripple.\n <br>' +
        '\n\r' +
        '<br>Уже спустя год Kraken заняла лидирующие позиции на криптовалютном рынке. Платформа стала крупнейшей по торговле биткоином за евро и была включена в рейтинг Блумберг. Это привлекло внимание крупных инвесторов, и они начали вкладываться в Кракен. Инвестиции способствовали росту трейдинг–платформы, она стала еще активнее развиваться и в конечном счете приобрела сегодняшний вид.\n <br>' +
        '\n' +
        '<br>Сейчас биржа предлагает широкий спектр финансовых услуг. Среди них спотовая и маржинальная торговля криптой, фиатные операции, стейкинг, денежные переводы. Но главное направление деятельности площадки — все-таки трейдинг.\n <br>' +
        '\n' +
        '<br>Кракен привлекает пользователей простой регистрацией, низкими комиссионными сборами и возможностью выполнять финансовые операции в фиатных валютах. Еще одна причина популярности биржи — очень легкая верификация, которую можно пройти буквально в пару кликов.</p>'
    },
    {
      header: 'Регистрация на бирже Kraken',
      body: '<img width="100%"\n' +
        '     src="https://content-cdn.meta.ua/ckeditor/images/b09dc000cdac2897ae95d6c509bd0f4599f49c543484b20c5a86b656fe38d33b.jpg">\n' +
        '<p class="box-description">\n' +
        '  <strong>\n' +
        '    Регистрация на бирже Kraken потребует выполнить следующие действия:\n' +
        '  </strong>\n' +
        '</p>\n' +
        '\n' +
        '<ol class="ordered-list">\n' +
        '  <li>\n' +
        '    Перейти на официальный сайт трейдинг-площадки.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Нажать на кнопку «Создать аккаунт».\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Указать свой e-mail.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Ввести имя пользователя, которое будет отображаться в ходе торговли с другими трейдерами.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Придумать пароль.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Согласиться с правилами биржи.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Нажать «Создать аккаунт».\n' +
        '  </li>\n' +
        '</ol>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  После этого пользователю предложат активировать новый профиль на сайте. Есть два способа сделать это. Первый — ввод\n' +
        '  кода в поле, которое должно появится после подтверждения намерения зарегистрироваться. Сама цифровая комбинация придет\n' +
        '  на указанный в форме почтовый ящик. Второй способ — переход по ссылке, содержащейся вместе с уникальным кодом в\n' +
        '  отправленном клиенту письме. Неважно, каким образом будет активирован аккаунт, — итог будет одинаковым. Так что выбор\n' +
        '  метода активации — это исключительно вопрос удобства.\n' +
        '</p>'
    },
    {
      header: 'Верификация на бирже Kraken: как пройти',
      body: '<p class="box-description">\n' +
        '  Приобретение ихранение криптовалюты на Kraken невозможно без верификации. Пройти ее можно из специального раздела\n' +
        '  личного кабинета. В зависимости от сообщенных данных и набора предоставленных документов, пользователю могут\n' +
        '  предоставить один из трех статусов: базовый, стандартный или про. Они отличаются по лимитам и возможностям.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  <strong>\n' +
        '    Для прохождения процедуры верификации необходимо сделать следующее:\n' +
        '  </strong>\n' +
        '</p>\n' +
        '\n' +
        '<ol class="ordered-list">\n' +
        '  <li>\n' +
        '    Навести курсор мыши на кнопку с именем пользователя.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    В открывшемся меню выбрать пункт «Верификация».\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Заполнить анкету (указать имя, фамилию, дату рождения, адрес, страну и телефон).\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Кликнуть «Продолжить» и выбрать профессию.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Загрузить фотографию или скан документа, удостоверяющего личность (паспорт, водительские права или ID).\n' +
        '  </li>\n' +
        '</ol>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Если к ПК подключена веб-камера, нужные бумаги можно сфотографировать прямо на нее — сайт биржи предусматривает такую возможность.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Если трейдер хочет получить базовый или стандартный статус верификации, это не займет много времени. В первом случае на все уйдет 1–2 минуты, а во втором — 3–4. Это обусловлено тем, что документы и персональную информацию проверяют автоматически. При получении pro-статуса проверка может занять несколько дней (максимум 5), причем в ходе нее администрация сервиса может затребовать у клиента дополнительные бумаги.\n' +
        '</p>'
    },
    {
      header: 'Вход на официальную биржу Kraken',
      body: '<img\n' +
        '  src="https://content-cdn.meta.ua/ckeditor/images/b1c304c7a42799619ad60db3b1f498df362cbde3e3f579987f7f3e4d8c80b393.jpg"\n' +
        '  sizes="100vw">\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Чтобы войти на биржу Kraken, не нужны анонимайзеры или специальные расширения для браузера. Ее сайт работает в правовом\n' +
        '  поле и не блокируется даже в странах постсоветского пространства. Если все-таки возникают какие-то проблемы со входом,\n' +
        '  ресурс сам ищет для пользователя зеркало. Это занимает буквально 3–4 секунды, и по истечении этого времени торговая\n' +
        '  платформа готова к использованию.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Чтобы авторизоваться в своем аккаунте, необходимо сделать следующее:\n' +
        '</p>\n' +
        '\n' +
        '<ol class="ordered-list">\n' +
        '  <li>\n' +
        '    Перейти на сайт kraken.com.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Нажать на кнопку «Войти».\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Ввести указанное при регистрации имя пользователя.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Вписать пароль.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Подтвердить вход.\n' +
        '  </li>\n' +
        '</ol>\n' +
        '\n' +
        '<p class="box-description">\n' +
        'Если у пользователя возникают проблемы с вводом пароля, его можно сделать видимым (по умолчанию он отображается в виде черных точек). Для этого необходимо нажать на изображение глаза напротив соответствующего поля в меню авторизации.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        'В блоке входа есть кнопка «Помощь». Если нажать на нее, откроется страница с несколькими ссылками:\n' +
        '</p>\n' +
        '\n' +
        '<ul class="unordered-list">\n' +
        '  <li>\n' +
        '    Сбросить пароль. Этот вариант выбирается, если трейдер забыл код для авторизации. Чтобы его восстановить,\n' +
        '    обязательно нужен доступ к e-mail, указанному при регистрации. Также понадобится актуальный никнейм.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Восстановить имя пользователя. Этот пункт нужен на случай, если владелец аккаунта забыл свой ник на сайте. В ходе\n' +
        '    процедуры понадобится доступ к почтовому ящику, привязанному к профилю Kraken.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Восстановить 2FA. Этот пункт выбирают при потере доступа к двухфакторной идентификации. Понадобятся имя\n' +
        '    пользователя, e-mail и мастер-ключ.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Свяжитесь со службой поддержки. Ссылка на случай, если клиент не помнит никакие данные для авторизации (никнейм,\n' +
        '    пароль, e-mail).\n' +
        '  </li>\n' +
        '</ul>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  <strong>\n' +
        '    <i>\n' +
        '      Важно! При восстановлении доступа к аккаунту через поддержку у пользователя могут попросить повторно пройти\n' +
        '      верификацию, предоставив в администрацию биржи удостоверяющие личность документы.\n' +
        '    </i>\n' +
        '  </strong>\n' +
        '</p>'
    },
    {
      header: 'Личный кабинет Kraken: обзор и возможности',
      body: '<p class="box-description">\n' +
        '  Чтобы попасть вличный кабинет Kraken, нужно навести курсор на кнопку с именем пользователя вверху страницы. После\n' +
        '  этого откроется меню, состоящее из трех блоков:\n' +
        '</p>\n' +
        '\n' +
        '<ol class="ordered-list">\n' +
        '  <li>\n' +
        '    Настройки.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Безопасность.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Верификация.\n' +
        '  </li>\n' +
        '</ol>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  В каждом из них есть подразделы, из которых можно управлять своим профилем. <strong>Блок настроек содержит\n' +
        '  следующие:</strong>\n' +
        '</p>\n' +
        '\n' +
        '<ul class="unordered-list">\n' +
        '  <li>\n' +
        '    <strong>Аккаунт.</strong> Здесь хранятся все данные пользователя: ник, пароль, информация для двухфакторной\n' +
        '    аутентификации. Также в подразделе можно настроить время автоматического выхода из своего профиля (от 1 до 240\n' +
        '    минут, отключить автовыход нельзя).\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>Уведомления.</strong> Тут предлагается включить или отключить оповещения о письмах от администрации биржи и\n' +
        '    рекламную рассылку.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>Документы.</strong> Здесь хранятся сканы бумаг, загруженные пользователем в ходе верификации.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>Аудиты.</strong> Данные о проверках счета трейдера администрацией площадки.\n' +
        '  </li>\n' +
        '</ul>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  В блоке «Безопасность» можно настроить вход и некоторые другие важные параметры. Он состоит из следующих подразделов:\n' +
        '</p>\n' +
        '\n' +
        '<ul class="unordered-list">\n' +
        '  <li>\n' +
        '    <strong> Обзор. </strong> Информация о пароле, последних активных сеансах, а также устройств, с которых заходили в\n' +
        '    аккаунт.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong> Настройки 2FA. </strong> В этом подразделе можно включить и настроить двухфакторную аутентификацию. При\n' +
        '    этом ее можно активировать не только для входа, но и для отдельных операций на сайте сервиса (например, для\n' +
        '    переводов).\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong> Блокировка настроек. </strong> Этот подраздел нужен на случай, если аккаунт взломали злоумышленники. Он\n' +
        '    полностью блокирует настройки, что исключает смену пароля. Срок блокировки выбирает сам пользователь, он может\n' +
        '    составлять от 1 до 29 дней. Восстановление доступа к изменению параметров ЛК осуществляется исключительно через\n' +
        '    службу поддержки.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong> Пользовательские API. </strong> Здесь можно создавать новые ключи и удалять уже существующие.\n' +
        '  </li>\n' +
        '</ul>\n' +
        '\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  В подразделе «Верификация» можно пройти проверку личности или повысить статус своего аккаунта для увеличения лимитов и\n' +
        '  получения новых возможностей.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Некоторые функции, так или иначе связанные с профилем трейдера и его деятельностью на сайте биржи, отсутствуют в ЛК и\n' +
        '  вызываются не из него. В частности, это касается истории транзакций. Чтобы посмотреть ее, необходимо нажать на кнопку\n' +
        '  вверху главной страницы. Переход в аккаунт при этом не требуется. Текущие и завершенные операции в разделе\n' +
        '  представлены в виде таблицы. Их можно сортировать по нескольким параметрам: дате начала и окончания, валюте, типу\n' +
        '  транзакции. Благодаря этому найти нужную позицию очень легко.\n' +
        '</p>'
    },
    {
      header: 'Как купить криптовалюту на бирже Kraken: все способы',
      body: '<p class="box-description">\n' +
        '  <strong>\n' +
        '    Чтобы приобрести токены на сайте Kraken, необходимо сделать следующее:\n' +
        '  </strong>\n' +
        '</p>\n' +
        '\n' +
        '<ol class="ordered-list">\n' +
        '  <li>\n' +
        '    Нажать на кнопку «Купить крипту» вверху экрана.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    На открывшейся странице нажать «Купить».\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Выбрать монету.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Указать сумму.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Подтвердить транзакцию.\n' +
        '  </li>\n' +
        '</ol>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Этот способкупить криптовалюту на бирже Kraken следует использовать только в случаях, когда срочно нужны токены. Он\n' +
        '  позволяет максимально быстро их получить, однако имеет ряд недостатков. Главные заключаются в том, что доступны далеко\n' +
        '  не все монеты и за каждую операцию взимается комиссия. Покупка без этих минусов возможна в разделе «Торги». Там нужно\n' +
        '  сформировать объявление, которое затем попадет в блок торговли. Там же можно самому поискать предложения о продаже.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">В отличие от мгновенной покупки, покупка через раздел «Торги» не гарантирует успешного приобретения крипты: другие\n' +
        '  пользователи вообще могут не ответить. Однако такое происходит довольно редко, и в основном на объявления откликаются,\n' +
        '  хотя это может занять много времени.</p>'
    },
    {
      header: 'Вывод средств с биржи Kraken',
      body: '<p class="box-description">\n' +
        '  <strong>\n' +
        '    Для вывода средств с криптовалютной биржи потребуется сделать следующее:\n' +
        '  </strong>\n' +
        '</p>\n' +
        '\n' +
        '<ol class="ordered-list">\n' +
        '  <li>\n' +
        '    Нажать на кнопку «Переводы» вверху страницы.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Установить чекбокс напротив пункта «Показать все активы».\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Нажать «Вывод» напротив строки с нужной валютой.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Выбрать реквизиты в блоке адрес (или указать новые).\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Ввести сумму.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    Подтвердить действие.\n' +
        '  </li>\n' +
        '</ol>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Если на аккаунте пользователя включена двухфакторная аутентификация, для подтверждения транзакции его попросят ввести\n' +
        '  дополнительный пароль. Без него заявка на вывод не будет активирована.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  При указании суммы нужно соблюдать правила, установленные криптобиржей. Для выводов на сумму меньше одного токена в\n' +
        '  начале числа указывается ноль. Допускается запись только цифрами, при этом их нельзя разбавлять запятыми — дроби\n' +
        '  разделяют исключительно точкой.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Вывод на карту с Kraken тоже возможен, но только при выполнении одного важного условия: трейдер должен указать и\n' +
        '  подтвердить свой банковский счет. Номера карточки и CVC будет недостаточно, нужны ее полные реквизиты. Выводить деньги\n' +
        '  в определенной валюте разрешается только в том случае, если используемый счет использует ее в качестве расчетного\n' +
        '  средства. Например, невозможно перевести средства в евро на долларовую карточку. Выводить в виде фиата можно и токены.\n' +
        '  В этом случае они будут автоматически обменяны по текущему курсу криптобиржи.\n' +
        '</p>' +
        '<div class="blockquote">\n' +
        '  <p class="box-description">\n' +
        '    Важно! Правила торговой площадки запрещают вывод на чужие реквизиты. Поэтому в качестве владельца счета, куда\n' +
        '    переводятся деньги, должен быть указан трейдер, на чье имя оформлен аккаунт на Kraken. В противном случае заявка на\n' +
        '    снятие будет аннулирована.\n' +
        '  </p>\n' +
        '</div>'
    },
    {
      header: 'Комиссии на бирже Kraken',
      body: '<p class="box-description">\n' +
        '  <strong>\n' +
        '    Одно из главных достоинств трейдинг площадки — отсутствие дополнительных платежей, которые есть на других\n' +
        '    аналогичных платформах.\n' +
        '  </strong>\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Однако в некоторых случаяхкомиссии на бирже Kraken платить все-таки придется. Ниже приведена таблица с указанием\n' +
        '  порядка взимания комиссионных платежей и их размера.\n' +
        '</p>' +
        '<ul class="table-wrapper">\n' +
        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      Тип операции' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      Размер комиссии\n' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      Пополнение счета в фиате\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      От $0 до $10 (зависит от выбранного банка-посредника)' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      Пополнение в фиате с банковской карты\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      3,75% от вносимой суммы + 0,25 € сверху' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      Вывод средств в крипте' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      0,00015 BTC или эквиваленте в другом токене' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      Вывод средств в фиате' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      От $0 до $35 (зависит от выбранного банка-посредника)' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      Торговля спотом (исполнение ордера)\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      От 0% до 0,26% (зависит от монеты и объема торгов)' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      Открытие маржи' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      0,01% от суммы сделки для BTC (для других токенов может отличаться)\n' +
        '    </p>\n' +
        '  </li>\n' +
        '</ul>' +
        '<p class="box-description">Поскольку лимиты на пополнение без комиссии очень лояльны, а через некоторые банки можно выводить средства совершенно\n' +
        '  бесплатно, фактически трейдер имеет возможность избежать дополнительных платежей на бирже.</p>'
    },
    {
      header: 'Мобильное приложение Kraken (скачать)', body: '<img\n' +
        '  src="https://blog.kraken.com/wp-content/uploads/2019/10/pro-crypto-trading-app.png">\n' +
        '\n' +
        '<p>\n' +
        '  <strong>Поскольку биржа работает в правовом поле, её софт представлен в официальных магазинах ПО Google и Apple.\n</strong>' +
        '</p>\n' +
        '\n' +
        '<p>\n' +
        '  В плане функционала мобильное приложение биржи полностью повторяет ее десктопный сайт. Оно позволяет трейдеру\n' +
        '  пополнять счет и снимать\n' +
        '  деньги, торговать криптовалютой. Однако процесс регистрации и верефикации лучше проводить через браузерную версию.\n' +
        '</p>\n' +
        '\n' +
        '<div class="blockquote">\n' +
        '  <p class="box-description">\n' +
        '    Важно! Если пользователь входит в профиль через ПО впервые, ему потребуется подтвердить новое устройство. Для этого\n' +
        '    на указанную при регистрации почту отправляют письмо со ссылкой. Подтверждение считается выполненным после перехода\n' +
        '    по ней. Без этого работать через мобильное приложение не получится— его экран будет закрыт баннером.\n' +
        '  </p>\n' +
        '</div>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Интерфейс ПО сильно отличается от десктопного, поэтому к нему придется привыкать. Как и на главной странице сайта, на\n' +
        '  основном экране ПО отображается пул ключевых криптовалют и фиатных платежных средств. Для некоторых колебания цены\n' +
        '  показываются не только в форме цифр, но и в виде графика.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Также в приложении есть раздел Top Gaining. В нем собраны монеты, которые на данный момент растут быстрее всего. Всего\n' +
        '  там 5 позиций. Соответственно, именно столько актуальных токенов и отображается. Рост учитывается за последние 24\n' +
        '  часа, поэтому ежесуточно проводится ротация валют. Прибавка в цене показывается в виде конкретной цифры в процентах от\n' +
        '  предыдущей стоимости.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Личный кабинет программы выполнен в виде отдельного экрана с кнопками перехода в разделы. Он дает пользователю те же\n' +
        '  возможности, что ЛК на десктопе, хотя визуально организован немного иначе. Через него можно настраивать параметры\n' +
        '  входа в аккаунт, изменять личные данные, выполнять другие важные действия. Есть функция, отсутствующая на сайте для\n' +
        '  ПК, — push-уведомления. Если активировать ее, трейдер будет видеть оповещения о колебании цены криптовалют, а также о\n' +
        '  состоянии своих операций.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Переключение между тремя основными разделами программы осуществляется с помощью кнопок, расположенных внизу экрана.\n' +
        '  Блоки торговли, переводов, стейкинга отсутствуют. Соответствующие функции биржи активируются иначе. Например,\n' +
        '  чтобыкупить биткоин на бирже Kraken через приложение, нужно сначала кликнуть по этой монете на главной, а уже потом\n' +
        '  выбрать подходящее действие на странице токена.\n' +
        '</p>'
    },
    {
      header: 'Спотовая и маржинальная торговля на Kraken',
      body: '<p class="box-description">\n' +
        '  Торговля на Kraken осуществляется из специального раздела (терминала), открывающегося\n' +
        '  нажатием на кнопку с изображением графика вверху экрана. Он имеет темный фон, который делает\n' +
        '  все надписи более контрастными и позволяет внимательнее следить за колебаниями котировок.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  <strong>\n' +
        '    Раздел содержит следующие элементы интерфейса:\n' +
        '  </strong>\n' +
        '</p>\n' +
        '\n' +
        '<ol class="ordered-list">\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      Блок выбора валютной пары.\n' +
        '    </strong>\n' +
        '    Находится вверху страницы и позволяет выбирать различные сочетания из какой-либо монеты и одного из традиционных\n' +
        '    платежных средств. В качестве последнего по умолчанию выступают доллар или евро. Однако при желании можно выбрать и\n' +
        '    другую валюту.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      График котировок.\n' +
        '    </strong>\n' +
        '    Отображает колебание цены токена по отношению к другому платежному средству из валютной пары. Выглядит вполне\n' +
        '    стандартно, выполняет свою главную функцию — позволяет отслеживать изменения котировок. Возможно масштабирование,\n' +
        '    которое осуществляется с помощью колесика мыши.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      Блок настроек.\n' +
        '    </strong>\n' +
        '    Находится между кнопками выбора валюты и графиком, дает возможность менять параметры последнего. Также в блоке\n' +
        '    настроек присутствует кнопка смены валютной пары.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      Ордера.\n' +
        '    </strong>\n' +
        '    Отображаются в отдельном блоке справа от графика. Их можно сортировать по условиям предложения с помощью специальной\n' +
        '    функции от списка с предложениями о продаже крипты. Также есть сортировка по сумме, которую хочет продать\n' +
        '    пользователь.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      Блок операций.\n' +
        '    </strong>\n' +
        '    Расположен в правой части раздела торговли. Тут можно подтвердить покупку криптовалюты у другого трейдера или\n' +
        '    создать собственный ордер.\n' +
        '  </li>\n' +
        '</ol>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Для приобретения токена необходимо кликнуть по предложению из соответствующего блока. Как\n' +
        '  только это будет сделано, вся информация из него будет перенесена в пустые поля в правой части\n' +
        '  экрана. Если условия сделки устраивают, нужно нажать на кнопку «Вемем апа Виу». После этого с\n' +
        '  баланса трейдера спишется нужная сумма и одновременно с этим будет зачислена другая,\n' +
        '  указанная в принятом предложении. Для отказа от сделки следует нажать на кнопку «Сброс».\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Для создания собственного ордера необходимо самостоятельно заполнить все поля в блоке\n' +
        '  операций, где потребуется указать количество токенов и стоимость одной монеты. Можно\n' +
        '  оформлять заявки и на покупку, и на продажу. Переключение между ними осуществляется с\n' +
        '  помощью кнопок, расположенных в верхней части блока операций. Отслеживать свои текущие\n' +
        '  ордера можно в разделе «История», переход в который выполняет с главной страницы биржи.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Маржинальная торговля на бирже Kraken ведется с той же страницы, что и спотовая. Чтобы\n' +
        '  получить средства для трейдинга от платформы, необходимо активировать плечо в общем разделе\n' +
        '  трейдинга. Это делается с помощью виртуального регулятора в блоке операций. Самостоятельно\n' +
        '  выбирать значения плеча нельзя, доступно лишь несколько предустановленных вариантов. Они не\n' +
        '  фиксированные и зависят от суммы, указанной пользователем при формировании заявки на сделку.\n' +
        '  <br>\n' +
        '  <strong>\n' +
        '    Предлагаются следующие варианты:\n' +
        '  </strong>\n' +
        '</p>\n' +
        '\n' +
        '<ul class="unordered-list">\n' +
        '  <li>\n' +
        '    2х\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    3х\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    4х\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    5x\n' +
        '  </li>\n' +
        '</ul>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Для возвращения к спотовой торговле необходимо переместить регулятор размера плеча в позицию "Нет".\n' +
        '</p>'
    }, {
      header: 'Акции и Бонусы Kraken', body: '<p class="box-description">\n' +
        'Криптовалютная биржа не может похвастаться обилием бонусов. Подарок за регистрацию не\n' +
        'предусмотрен, VIP-статус и льготные условия использования площадки тоже отсутствуют.\n' +
        'Получить вознаграждение можно только в рамках программы Bug Bounty. По ее условиям\n' +
        'пользователи сообщают администрации сервиса об ошибках в его работе, а та дает им за это\n' +
        'бонусные средства. Они начисляются сразу в реальной валюте — токенах или фиате. Минимальная\n' +
        'величина вознаграждения в долларовом эквиваленте — $500. Поскольку размер подарка зависит\n' +
        'от степени серьезности выявленной ошибки и определяется индивидуально, он может быть.\n' +
        'гораздо больше этой суммы.\n' +
        '</p>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '<strong>Важно!</strong> Обязательное условие получения бонуса в рамках программы Bug Bounty — возможность\n' +
        'проверить сообщение клиента, а также угроза безопасности трейдинг-площадки из-за выявленной\n' +
        'ошибки. Если эти требования не соблюдены, то и вознаграждения не будет.\n' +
        '</p>\n'
    }, {
      header: 'Прочие возможности Kraken',
      body: '<img src="https://www.moneyunder30.com/wp-content/uploads/2021/05/kraken-review-sign-up-4.png">\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Кроме покупки криптовалюты и трейдинга, Kraken предлагает клиентам ряд других возможностей:\n' +
        '</p>\n' +
        '\n' +
        '<ul class="unordered-list">\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      Операции OTC (over-the-counter).\n' +
        '    </strong>\n' +
        '    Представляют собой сделки, которые не отображаются в общем списке ордеров в терминале. При этом посредником между\n' +
        '    сторонами все равно продолжает выступать Kraken. Используются для торговли на крупные суммы, чтобы оставить\n' +
        '    транзакцию в тайне и не нарушать естественное формирование биржевых цен.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      Денежные переводы.\n' +
        '    </strong>\n' +
        '    С помощью торговой платформы можно переводить деньги другим людям. Для этого разрешается использовать как\n' +
        '    криптовалюты, так и фиат.\n' +
        '  </li>\n' +
        '  <li>\n' +
        '    <strong>\n' +
        '      Стейкинг.\n' +
        '    </strong>\n' +
        '    Этим термином обозначают хранение средств на счете в целях обеспечения криптовалютных операций других пользователей.\n' +
        '    По сути, часть токенов клиента будет заблокирована, однако он получит за это вознаграждение.\n' +
        '  </li>\n' +
        '</ul>\n' +
        '\n' +
        '<p class="box-description">\n' +
        '  Все дополнительные функции активируются с помощью стандартных элементов интерфейса площадки. Исключение — операции OTC, для выполнения которых надо заполнить специальную форму и отправить ее администрации биржи.\n' +
        '</p>'
    }, {
      header: 'Support', body: '<p class="box-description">\n' +
        '    Работу службы поддержки биржи можно оценить как хорошую. Специалисты саппорта отвечают очень быстро и всегда по\n' +
        '  существу, решая большинство возникших у пользователей проблем. Проще всего связаться с техподдержкой посредством\n' +
        '  онлайн-чата, кнопка вызова которого располагается внизу экрана. Это не бот: клиенту будет помогать живой оператор\n' +
        '  поддержки. Сотрудники компании общаются только по-английски. Если им пишут на другом языке, они переводят его с\n' +
        '  помощью встроенного переводчика Kraken. Из-за этого общение не всегда получается содержательным, так как перевод\n' +
        '  зачастую выходит «корявый».\n' +
        '</p>\n' +
        '<p class="box-description">\n' +
        '  Адресов электронной почты биржи в открытом доступе нет, поэтому написать в поддержку по e-mail не получится.\n' +
        '\n' +
        '</p>\n' +
        '<p class="box-description">\n' +
        '  Другой способ связи с саппортом — телефон горячей линии <a href="tel:+35312238162">+ 353-1-223-8162</a>. Колл-центр компании расположен в Ирландии.\n' +
        '</p>\n' +
        '<p class="box-description">\n' +
        '  У торговой платформы есть официальная страничка в Facebook. Обратиться за помощью можно и туда, для этого необходимо\n' +
        '  написать сообщение с соответствующим вопросом администрации группы. Поскольку паблик англоязычный, то лучше сразу\n' +
        '  писать на английском — в противном случае может возникнуть недопонимание.\n' +
        '</p>\n'
    }
  ]

  characteristic: MarkUpDataInterface = {
    header: 'Characteristics',
    body:           '<ul class="table-wrapper">\n' +
        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      📌 Бренд компании' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      Kraken\n' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      📅 Год основания\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      2011' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      👨‍💼 Основатель\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      Jesse Powell' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '     🚩 Место основания' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      USA' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      🎁 Основной бонус' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      Bug Bounty' +
        '    </p>\n' +
        '  </li>\n' +

        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      📞 Телефон\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '      <a href="tel:+35312238162">+ 353-1-223-8162</a>' +
        '    </p>\n' +
        '  </li>\n' +
                '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      💲 Минимальный депозит\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '   5 USDT. <a href="https://support.kraken.com/hc/en-us/articles/360000292886-Cryptocurrency-deposit-fees-and-minimums">Таблица с лимитами</a>' +
        '    </p>\n' +
        '  </li>\n' +
                        '  <li class="table-row">\n' +
        '    <p class="table-row__left">\n' +
        '      💸 Минимальный трейд\t' +
        '    </p>\n' +
        '\n' +
        '    <p class="table-row__right">\n' +
        '   5 USDT. <a href="https://support.kraken.com/hc/en-us/articles/205893708-Minimum-order-size-volume-for-trading">Таблица с лимитами</a>' +
        '    </p>\n' +
        '  </li>\n' +
        '</ul>'
  };




  test = ['test', 'test', 'test', 'test', 'test', 'test', 'test',]

  constructor() {
  }

  ngOnInit(): void {
    this.ratingStars = this.exchangeData.numOfStars
  }

  setClassToStar(count: number) {
    if (this.ratingStars) {
      this.ratingStars -= 1;
      return ' filled'
    }
    return ''
  }
}
